### Quick Intro about the features

* **pclass**: Passenger class (1 = 1st class, 2 = 2nd class, 3 = 3rd class)
* **name**: Name of the passenger
* **sex**: Sex of the passenger (male or female)
* **age**: Age of the passenger
* **sibsp**: Number of siblings/spouses aboard the Titanic
* **parch**: Number of parents/children aboard the Titanic
* **ticket**: Ticket number
* **fare**: Passenger fare (the amount of money paid for the ticket)
* **cabin**: Cabin number where the passenger stayed
* **embarked**: Port of embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)
* **boat**: Lifeboat number used by the passenger (if they survived)
* **body**: Body identification number (if recovered)
* **home.dest**: Home or destination of the passenger
* **Survived**: Survival status (0 = No, 1 = Yes)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from sklearn.datasets import fetch_openml

In [13]:
dir(fetch_openml)

['__annotations__',
 '__builtins__',
 '__call__',
 '__class__',
 '__closure__',
 '__code__',
 '__defaults__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__get__',
 '__getattribute__',
 '__getstate__',
 '__globals__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__kwdefaults__',
 '__le__',
 '__lt__',
 '__module__',
 '__name__',
 '__ne__',
 '__new__',
 '__qualname__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__wrapped__',
 '_skl_parameter_constraints']

In [14]:
titanic_data = fetch_openml('titanic', version = 1, as_frame = True)
# as_frame = True is that to convert the data into dataframe
# and the version is to fully manipulated or particially manipulated

* the data is divided into two types one is **Independent data(features)** and other is **Dependent variable(target)**

In [16]:
df = titanic_data['data']
df.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [19]:
# adding the target value in a dataset
df['Survived'] = titanic_data['target']
df.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0

In [21]:
df.columns

Index(['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'boat', 'body', 'home.dest', 'Survived'],
      dtype='object')

## we need to perform EDA

In [24]:
df.shape

(1309, 14)

In [23]:
df.isna().sum()

pclass          0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
Survived        0
dtype: int64

In [ ]:
the data is less so we can't delete the records instead we can take the abs mean value for the null values

In [ ]:
we don't need of names because we can't predict the target based on names so we need to remove it